"""
                                    === Основной файл приложения ===

## V 0.0.1

    создать проект на git hub
    создать файл основного приложения
    создать основной цикл

## V 0.0.2

    реализовать место хранения задач
    создать функцию показа заметок
    создать функцию добавления заметок

## V 0.0.3

    реализовать сохранение задач
    реализовать вывод списка задач
    реализовать редактирование и удаление задач

## V 0.0.4

    добавлены проверки и подтверждения

## V 0.0.5

    созданы методы сохранения и загрузки - файлы сохранение

## V 0.0.6

    созданы методы для удаления, редактирования и создания задач - логика вынесена из цикла

## V 0.0.7

    основной цикл помещен в отдельный метод - def main

## V 0.0.8

    реализован функционал добавления контента задачи - имя + содержания

## V 0.0.9

    реализован переход на модульную систему

## v 0.1.0

    Подготовка к сборке приложения
"""
import app

if __name__ == "__main__":
    app.app()